In [10]:
#Date: 13/04/2024 Day: Saturday
#Programmer: Affaan Attar
#College: Keystone School Of Engineering
#Class: TE-B(Computer)
#Roll No.: 50

In [5]:
# Pandas -> Structured Data Analysis
import pandas as pd
#numpy -> array operations
import numpy as np

ARRAY

In [6]:
num = np.array([34,12,37,65,48,79,15])

In [7]:
num

array([34, 12, 37, 65, 48, 79, 15])

In [8]:
num.dtype

dtype('int32')

In [9]:
num[2]

37

SERIES

In [10]:
r = pd.Series([1,2,3,4,5,])
n = pd.Series(['prem','raj','kiran','priya','asha'])
m = pd.Series([67.89,73.57,71.56,67.34,66.66])

In [11]:
r

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
n

0     prem
1      raj
2    kiran
3    priya
4     asha
dtype: object

In [13]:
m

0    67.89
1    73.57
2    71.56
3    67.34
4    66.66
dtype: float64

In [14]:
type(m)

pandas.core.series.Series

In [15]:
m[4]

66.66

In [16]:
df = pd.DataFrame({
    'roll': r,
    'name': n,
    'marks': m
})

In [17]:
df

   roll   name  marks
0     1   prem  67.89
1     2    raj  73.57
2     3  kiran  71.56
3     4  priya  67.34
4     5   asha  66.66

In [18]:
df.shape

(5, 3)

In [19]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [20]:
type(df)

pandas.core.frame.DataFrame

STRUCTURED DATA ANALYSIS

In [21]:
import os
os.getcwd()

'C:\\Users\\LENOVO\\OneDrive\\Desktop\\Internship Training'

IMPORT THE DATA

In [22]:
df1 = pd.read_csv('student.csv')

In [23]:
df1

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [24]:
dfn = pd.read_csv('student1.csv')

In [25]:
dfn

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [26]:
cols= ['A','B','C','D','E']

In [28]:
df2 = pd.read_csv('student1.csv', names = cols)

In [29]:
df2

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [30]:
df3 = pd.read_csv('student3.csv')

In [31]:
df3

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
4      5     asha    TE   63.28   NaN
5      6   ayesha    BE     NaN  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
9      9     amol    TE   56.75  20.0
10    10    anmol    BE   78.66   NaN
11    11   surbhi    TE     NaN  23.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
14    14   sachin   NaN   59.33  21.0
15    15  shalini    TE   63.45  20.0

In [38]:
df4 = pd.read_csv('student3.tsv')

In [39]:
df4

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [40]:
df5 = pd.read_csv('student3.tsv', sep = '\t')

In [41]:
df5

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [42]:
df6 = pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv ')

In [43]:
df6

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [44]:
df7 = pd.read_excel('student.xlsx')

In [45]:
df7

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

USING THE DATA FRAME OBJECT ATTRIBUTES METHODS

In [46]:
df1.shape

(10, 5)

In [47]:
df1.size

50

In [48]:
df1.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [49]:
df1.index

RangeIndex(start=0, stop=10, step=1)

In [50]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [51]:
df.T

           0      1      2      3      4
roll       1      2      3      4      5
name    prem    raj  kiran  priya   asha
marks  67.89  73.57  71.56  67.34  66.66

In [52]:
df.ndim

2

FUNCTIONS OR METHODS

In [53]:
df.head()

   roll   name  marks
0     1   prem  67.89
1     2    raj  73.57
2     3  kiran  71.56
3     4  priya  67.34
4     5   asha  66.66

In [54]:
df.tail()

   roll   name  marks
0     1   prem  67.89
1     2    raj  73.57
2     3  kiran  71.56
3     4  priya  67.34
4     5   asha  66.66

In [55]:
df.tail(3)

   roll   name  marks
2     3  kiran  71.56
3     4  priya  67.34
4     5   asha  66.66